In [1]:
import pandas as pd

In [3]:
data = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [4]:
list('321')

['3', '2', '1']

In [6]:
df = pd.DataFrame(data = data, index = list('321'), columns = list('zyx'))
df

   z  y  x
3  1  2  3
2  4  5  6
1  7  8  9

In [7]:
df.sort_index(inplace = True) # ordena valores do index de forma crescente(por padrão, porém, pode ser alterado usando o argumento ascending)

In [8]:
df

   z  y  x
1  7  8  9
2  4  5  6
3  1  2  3

In [9]:
df.sort_index(inplace = True, axis = 1) # o argumento axis nos permite ordenar valores das colunas de forma crescente

In [10]:
df

   x  y  z
1  9  8  7
2  6  5  4
3  3  2  1

In [12]:
df.sort_values(by = 'x', inplace = True) # ordenando os valores apartir da coluna 'x'

In [13]:
df

   x  y  z
3  3  2  1
2  6  5  4
1  9  8  7

In [14]:
df.sort_values(by = '3', axis = 1, inplace = True) # ordenando os valores apartir da linha '3'

In [15]:
df

   z  y  x
3  1  2  3
2  4  5  6
1  7  8  9